{"status": "OK", "bill": {"bill_id": 1658304, "change_hash": "e988be13e547a63650ff36b09b85f6eb", "session_id": 2038, "session": {"session_id": 2038, "state_id": 48, "year_start": 2023, "year_end": 2023, "prefile": 0, "sine_die": 0, "prior": 0, "special": 0, "session_tag": "Regular Session", "session_title": "2023 Regular Session", "session_name": "2023 Regular Session"}, "url": "https://legiscan.com/WV/bill/HB2527/2023", "state_link": "http://www.wvlegislature.gov/Bill_Status/Bills_history.cfm?input=2527&year=2023&sessiontype=RS&btype=bill", "completed": 0, "status": 1, "status_date": "2023-01-13", "progress": [{"date": "2023-01-13", "event": 1}, {"date": "2023-01-13", "event": 9}], "state": "WV", "state_id": 48, "bill_number": "HB2527", "bill_type": "B", "bill_type_id": "1", "body": "H", "body_id": 1, "current_body": "H", "current_body_id": 1, "title": "Relating to revising the criminal code generally", "description": "The purpose of this bill is to revise the criminal code. The bill relates to the failure of a sex offender to register or provide notice of registration changes and the penalty for the same. The bill relates to timber theft, investigations thereof, and the criminal and civil penalties for the same. The bill provides for crimes against the worker's compensation system. The bill provides for the crime of omission to subscribe for workers' compensation insurance. The bill provides for the crime of failure to file a premium tax report or pay premium taxes. The bill provides for crimes relating to false testimony or statements concerning such. The bill provides for the crime of failure to file reports. The bill provides for criminal penalties for such actions or inactions. The bill provides for provisions for asset forfeiture. The bill provides for venue for trial of such crimes. The bill provides for the crime of wrongfully seeking workers' compensation. The bill provides for criminalizing false testimony or statements given in support of the same. The bill provides for criminal penalties for these offenses. The bill provides venue for the trial of such crimes. The bill provides for workers' compensation health care offenses. The bill provides for penalties for fraud. The bill provides for penalties for theft or embezzlement. The bill provides for penalties for false statements. The bill provides for criminal penalties for the above listed offenses. The bill provides for notice requirements. The bill provides for a prohibition against providing future services. The bill provides for penalties for the same. The bill provides for provisions for asset forfeiture. The bill establishes venue for the trial of such crimes. The bill defines the crime of providing false documentation to workers' compensation, to the Insurance Commissioner or a private carrier of workers' compensation insurance. The bill criminalizes altering documents or certificates from workers' compensation. The bill provides criminal penalties for such offenses. The bill establishes venue for the trial of such crimes. The bill provides for the required reporting of gunshot and other wounds. The bill provides for the required reporting of burns. The bill provides for a penalty for aiding and abetting. The bill provides for railroad employees being conservators of the peace. The bill establishes special railroad policemen, and the powers and duties of the same. The bill relates to shooting ranges, limitations on nuisance actions, and noise ordinances. The bill relates generally to criminal activity and the punishment thereof. The bill provides for the wanton endangerment involving the use of fire, and the criminal penalty for the same. The bill relates to crimes against the government. The bill defines treason, the crime of treason, and penalties therefor, the crime of failure to give information of treason and its penalty. The bill provides for the crime of desecration of the flag, and its penalty. The bill relates to crimes against the person, first- and second-degree murder defined, and punishment for the same. The bill delineates provisions for allegations in indictment for homicide. The bill defines voluntary manslaughter and the penalty thereof. The bill defines involuntary manslaughter, and specifies the penalty for the same. The bill defines concealment of a deceased human body, and specifies the penalty for the same. The bill clarifies that Homicide is punishable within the state if injury occurs within and death without, or vice versa. The bill defines an attempt to kill or injure by poison, and specifies the penalty for the same. The bill defines the crime of abortion and the penalty for the same. The bill defines malicious or unlawful assault, assault, and battery, and specifies the penalties for each and aggravated factors and enhanced penalties. The bill defines provisions of sentencing for such acts committed by incarcerated persons. The bill defines assault during the commission of or attempt to commit a felony, and specifies the penalty for the same. The bill delineates that for violent crimes against the elderly a sentence is not subject to suspension or probation. The bill defines harassment, and provides penalties, and certain definitions for the same. The bill defines strangulation, suffocation, and asphyxiation and provides definitions and penalties for the same. The bill defines robbery or attempted robbery and specifying the penalties for the same. The bill defines extortion, and attempted extortion by threat, and specifies the penalty for these. The bill defines kidnapping and specifies penalties for the same. The bill defines concealment or removal of a minor child from custodian or from person entitled to visitation. The bill sets forth penalties and defenses for the same. The bill provides that one aiding or abetting in kidnapping or in concealing or removing a minor child is guilty as a principal and explains venue for those offenses. The bill defines unlawful restraint and provides penalties for the same. The bill prohibits the purchase or sale of a child, sets the criminal penalty for the same, and provides definitions and exceptions. The bill defines the failure to remove doors from abandoned refrigerators, freezers and other appliances, and provides penalties for the same. The bill provides definitions for various forms of domestic violence and criminal penalties. The bill provides definitions and criminal penalties for the abuse or neglect of an incapacitated adult. The bill provides criminal penalties for the death of an incapacitated adult by a caregiver. The bill defines and provides criminal penalties for the financial exploitation of an elderly person, protected person or incapacitated adult. The bill recognizes an embryo or fetus as a distinct unborn victim of certain crimes of violence against the person. The bill relates to crimes against property, arson, the degrees of arson, and definitions and criminal penalties for the same, burning, or attempting to burn, insured property and the criminal penalty for the same. The bill provides for a person causing injuries during an arson-related crime, and the criminal penalties for the same. The bill provides for the recovery of costs incurred in fighting fires caused by arson. The bill defines burglary, the entry of dwelling house or outbuilding, and provides criminal penalties for the same. The bill defines entry of a house, building, vehicle, or enclosed property, the criminal penalties for the same, and specifies counts in indictment for the same. The bill provides for the manufacture or possession of burglary tools, and the criminal penalties for the same. The bill sets forth criminal offenses involving theft detection shielding devices, their criminal penalties and provides for detention of persons suspected of this offense. The bill provides for grand larceny, aggravated grand larceny, and petit larceny distinguished, sets forth the criminal penalties for each, defines larceny of bank notes, checks, writings of value and book accounts, and delineates the determination of value in larceny. The bill explains receiving or transferring stolen goods and provides a criminal penalty. The bill provides a criminal penalty for bringing into this state, receiving or disposing of property stolen in another state. The bill defines embezzlement, and the criminal penalties for the same. The bill defines falsifying accounts, and the criminal penalties for the same. The bill defines possession or use of automated sales suppression devices, and the criminal penalties for the same. The bill defines the offenses of destroying or concealing a will, and embezzlement by fiduciary, and the criminal penalties for the same. The bill defines obtaining money, property and services by false pretenses, disposing of property to defraud creditors, and the criminal penalties for each of these. The bill lays out the offenses of attempted or fraudulent use, forgery, traffic of credit cards, possession and transfer of credit cards and credit card making equipment, the false or fraudulent use of telephonic services, and the criminal penalties for these offenses. The bill defines intercepting or monitoring customer telephone calls, and the criminal penalties for the same. The bill defines requirements for finding fraudulent schemes and provisions for the cumulation of amounts where a common scheme exists, and the criminal penalties for the same. The bill defines the casting away, destroying, or interfering with floating craft or material, and the criminal penalties for the same, interference with or destruction of buoys, signal lights or other aids to navigation, and the criminal penalties for the same. The bill defines the offense of malicious killing of animals by poison or otherwise, and the criminal penalties for the same, the removal out of a county of property securing a claim, and the criminal penalties for such offense. The bill defines the fraudulent disposition of personal property in possession by virtue of lease, notice to return, failure to return, and penalties where such property is not returned, noting a right to immediate possession in such instances. The bill defines making a false statement as to financial condition of person, firm or corporation, and the criminal penalty for the same. The bill defines publication of false advertisements, and the criminal penalty for the same. The bill defines fraudulently obtaining food or lodging, and the criminal penalty for the same. The bill defines intoxication of a person in charge of locomotive engine or car, and the criminal penalty for the same. The bill defines the offenses of jumping on or off car or train in motion, driving vehicle upon track or bridge except at crossings, and the criminal penalty for the same. The bill defines procuring gas, water or electricity, by device, with intent to defraud, and the criminal penalty for the same. The bill defines placing a dam or obstructions in watercourses, and the criminal penalty for the same. The bill sets forth requirements for the purchase of scrap metal by scrap metal purchasing businesses, salvage yards, or recycling facilities. The bill requires certificates, records, and reports of such purchases. The bill provides criminal penalties for violations of these provisions. The bill sets forth requirements for the purchase of items by precious metals and gem dealers, records to be kept by them, and delineating prohibited acts, and the criminal penalty for the same. The bill criminalizes the unauthorized use of dumpsters and sets forth penalties. The bill defines the offense of identity theft and provides a penalty. The bill criminalizes the failure to pay for gasoline and providing a penalty. The bill provides for the offense of scanning device or re-encoder fraud, delineates when it is a felony, provides definitions, and sets forth criminal penalties for the same. The bill defines the offense of possession of bogus receipts or universal product codes with intent to defraud, and the criminal penalties for the same. The bill defines the offense of misrepresentation of past or present military status or military awards to obtain anything of value and delineates criminal penalties for the same. The bill relates to shoplifting. The bill prescribes penalties. The bill defines the crime of organized retail theft, and provides penalties for that offence, all related to trespass, trespass in a structure or conveyance and penalties for the same. The bill defines trespass on property other than a structure or conveyance, removal, injury to or destruction of property, monuments designating land boundaries and of certain no trespassing signs and penalties for the same. The bill defines trespass on student residence premises or student facility premises of an institution of higher education and penalties for the same. The bill defines trespass on state government property. The bill defines aiding and abetting, and penalties for each of those offenses. The bill defines the offense of mine trespass, and penalties for the same. The bill defines animal or crop facilities trespass. The bill provides penalties for the same. The bill allows for injunctive relief in such instances, offenses involving damage to shrubbery, flowers, trees and timber, provides for a limitation of application of the relevant subsection, and provides penalties. The bill prohibits cutting, damaging, or carrying away without written permission, any timber, trees, growing plants or the products thereof. The bill provides treble damages for the same. The bill creates the Critical Infrastructure Protection Act. The bill defines terms relevant to the same. The bill prohibits certain acts, including trespass and conspiracy to trespass against property designated a critical infrastructure facility. The bill provides criminal penalties and allows for certain forms of civil action in such instances. The bill relates to the West Virginia Computer Crime And Abuse Act and defines terms. The bill defines computer fraud, access to legislative or state-owned computer, criminal penalties for the same, unauthorized access to computer services and criminal penalties for the same, unauthorized possession of computer data or programs and criminal penalties for the same, unauthorized possession of computer data or programs and criminal penalties for the same, alteration, destruction, etc., of computer equipment, and criminal penalties for the same, unauthorized possession of computer information, and criminal penalties for the same. The bill defines disclosure of computer security information and criminal penalties for the same, computer invasion of privacy and criminal penalties for the same, fraud and related activity in connection with access devices, and criminal penalties for the same. The bill defines endangering public safety, and criminal penalties for the same. The bill defines obscene, anonymous, harassing and threatening communications by computer, cell phones and electronic communication devices, and criminal penalties for the same. The bill defines soliciting, etc. a minor via computer; soliciting a minor and traveling to engage the minor in prohibited sexual activity, cyberbullying or specific acts of electronic harassment of minors, definitions, and criminal penalties for the same. The bill provides for exceptions. The bill defines the use of a computer as an instrument of forgery and provides civil relief and damages available. The bill provides defenses to criminal prosecution; venue; prosecution under other criminal statutes not prohibited; personal jurisdiction; and severability. The bill relates to the theft of cable television services, the acquisition of cable television services, and penalties for wrongfully acquitting the same. The bill defines the sale or transfer of a device or plan intended for acquisition or diversion, and criminal penalties for the same. The bill defines Illegal possession of destructive devices, explosive materials or incendiary devices, and the criminal penalty for the same. The bill defines criminal use of destructive device, explosive material or incendiary device; and the criminal penalty for the same. The bill defines causing accidental or intentional death or injury, penalties, causing death or injury to an explosives detection animal, and the penalty for the same. The bill defines manufacture, purchase, sale, advertising for sale, transporting or possession or use of a hoax bomb. The bill defines the possession or use in commission of a felony, and the penalty for the same. The bill defines theft of explosive material from storage magazines or buildings, and the penalty for the same. The bill defines receipt, possession, storage, sale or transportation of stolen explosive material, and the criminal penalty. The bill defines wanton endangerment involving destructive devices, explosive materials or incendiary devices, and the criminal penalty. The bill defines contraband, seizure, forfeiture of explosive devices. The bill relates to crimes involving worthless checks. The bill defines obtaining property in return for worthless check, and the criminal penalties for the same. The bill defines making, issuing, etc., worthless checks on a preexisting debt, and the criminal penalties for the same. The bill defines payment as a defense to such offenses, requiring making a statement for the reason for dishonor a duty of the drawee, defining what constitutes prima facie evidence of knowledge, setting forth requirements for identity, and providing a criminal penalty for providing false information. The bill defines requiring a notice of dishonor by payee and provides for a service charge. The bill prescribes the manner of filing complaint for warrant and the form thereof. The bill provides guidance for a complaint, what constitutes notice of complaint, and the issuance of a warrant; delineating payment procedures, and imposing costs; providing for the payment of costs in worthless check cases, and the disposition of certain costs; requiring the preparation of a list of worthless check warrants; the use of that worthless check list upon receipt of complaint for warrant; delineating the duties of a prosecuting attorney upon receipt of notice of multiple worthless check warrants. The bill requires the magistrate court clerk to advise complainant. The bill provides for the creation and operation of a program for worthless check offenders, and requirements for acceptance of a person in that program. The bill requires certain notice to persons accepted to the worthless check restitution program. The bill defines agreement to suspend prosecution of a person accepted into the restitution program. The bill provides for fees for participation in the worthless check restitution program, and, providing that statements by individuals referred to or participating in the worthless check restitution program are criminally inadmissible. The bill relates to forgery, crimes against the currency, the forgery of public records, certificates, returns or attestation of a court or officer, and the criminal penalty for the same. The bill defines forgery of official seals. The bill defines keeping or concealing instrument for forging same. The bill defines the criminal penalty for the same. The bill defines counterfeiting, and the criminal penalty for the same, making plates, etc., for forgery, possession of same, and the criminal penalty for that offense. The bill defines forging or uttering other writing and the criminal penalty for the same. The bill defines creation of unauthorized demand draft, possession of counterfeit currency with intent to utter, and the criminal penalty for the same. The bill defines unauthorized currency, and the criminal penalty for the same. The bill defines passing or receiving unauthorized currency knowingly, and the criminal penalty for the same, and the unauthorized use, transfer, acquisition, alteration or possession of certain benefits and the criminal penalty for the same. The bill defines payment cards and falsely making or lading the same, and the criminal penalty, therefore. The bill relates to crimes against public justice generally; perjury and subornation of perjury defined. The bill defines false swearing, and the criminal penalties for perjury, subornation of perjury, and false swearing. The bill defines aiding escape and other offenses relating to adults and juveniles in custody or confinement. The bill defines criminal penalties for the same. The bill defines permitting escape, refusal of custody of prisoner, and criminal penalties for the same. The bill defines persons in custody of institutions or officers. The bill defines escapes and aiding in escapes, and criminal penalties for the same. The bill defines terms of confinement in addition to previous sentence. The bill defines escapes from, and other offenses relating to, state benevolent and correctional institution, or private prison or mental health facilities and criminal penalties for the same. The bill defines escape from custody of the commissioner of corrections and criminal penalties for the same. The bill defines escape from custody of the director of juvenile services. The bill defines refusal of officer to make, or delay in making, arrest, and criminal penalties for the same. The bill defines refusal of person to aid officer and criminal penalties for the same. The bill defines refusal of officer to execute act or process of legislature or order of governor, and criminal penalty for the same. The bill defines obstructing officer, fleeing from officer; making false statements to officer, interfering with emergency communications, criminal penalties for the same, definition, officer not liable for act done under statute or executive order afterward declared unconstitutional. The bill defines compounding offenses and misprision and criminal penalties for the same. The bill defines exacting excessive fees and criminal penalties for the same. The bill defines issuing fraudulent fee bills and criminal penalties for the same. The bill defines alteration, concealment or destruction of public record by officer and criminal penalty for the same. The bill defines larceny, concealment or destruction of public record by person not officer, and criminal penalty for the same. The bill defines corrupt summoning of jurors to find biased verdict, and criminal penalty for the same. The bill defines procuring the summoning of biased juror by party other than officer, and criminal penalty for the same. The bill defines discrimination against employee summoned for jury duty, and criminal penalty for the same. The bill defines contempt of court, what constitutes contempt, jury trial, presence of defendant, and criminal penalty for the same. The bill defines fraudulent official proceedings, causing a public employee or official to file a fraudulent legal process and criminal penalty for the same. The bill defines impersonation of a public official, employee or tribunal, and criminal penalties for the same. The bill defines impersonation of a public official or tribunal. The bill defines impersonation of a law-enforcement officer, and criminal penalties for the same. The bill defines subsequent offense, failure to perform official duties and criminal penalty for the same. The bill defines the failure to meet an obligation to pay support to a minor and criminal penalties for the same. The bill defines bribery and corrupt practices, and the criminal penalties for such offenses. The bill defines crimes against the peace generally, mobs and lynching, and the criminal penalties for the same. The bill defines liability of county or city in such instances. The bill defines disturbance of religious worship and the criminal penalty for the same. The bill defines disturbance of schools, societies, and other assemblies and the criminal penalty for the same. The bill defines loitering on school property and the criminal penalty for the same. The bill defines exceptions, camping upon governmental grounds or lawns and the criminal penalty for the same. The bill defines public nuisance, false reports concerning bombs or other explosive devices and the criminal penalty for the same. The bill defines falsely reporting an emergency incident and the criminal penalty for the same. The bill defines willful disruption of governmental processes, offenses occurring at State Capitol Complex, and the criminal penalties for the same. The bill defines threats of terrorist acts, conveying false information concerning terrorist acts and committing terrorist hoaxes prohibited, and the criminal penalties for the same. The bill defines prohibiting violations of an individual's civil rights, and the criminal penalties for the same. The bill defines wearing masks, hoods or face coverings and the criminal penalty for the same. The bill defines falsely reporting child abuse and the criminal penalty for the same. The bill defines classifying criminal penalties for failing to register as a sex offender, failure to provide information change, and providing false information to the sex offender registry. The bill defines deleting requirement that a person be deemed a rioter if they failed to provide required assistance at a riot. The bill defines the penalty for crime of failure to obey an order given at a riot or unlawful assembly. The bill provides that the crime of disorderly conduct is a petty offense. The bill modifies penalties for carrying a deadly weapon without provisional license or other authorization by persons under twenty-one years of age. The bill defines enumerating penalty for violation of the confidentiality provisions of a concealed carry license application. The bill provides for a provisional license to carry deadly weapons and how the same is obtained. The bill defines revocation of concealed carry license, providing exceptions as to prohibitions against carrying concealed handguns for persons at least eighteen years of age and fewer than twenty-one years of age and exemptions for the same from licensing fees. The bill provides for reciprocity and recognition of out-of-state concealed handgun permits. The bill enumerates persons prohibited from possessing firearms. The bill defines setting forth the right of nonprohibited persons over twenty-one years of age to carry concealed deadly weapons. The bill defines offenses and penalties. The bill describes a process for reinstatement of rights to possess and offenses and penalties. The bill prohibits possession of deadly weapons by minors. The bill defines brandishing deadly weapons and thereby threatening or causing breach of the peace and providing criminal penalties for the same. The bill creates and defines offenses of Possessing deadly weapons on premises of educational facilities and on premises housing courts of law and family law courts. The bill provides for reports by school principals. The bill provides penalties including suspension of driver's license. The bill defines offense of wanton endangerment using a firearm and providing penalties. The bill defines right of certain persons to limit possession of firearms on premises. The bill defines persons prohibited from committing violent crime while wearing body armor and penalties for same. The bill defines the offense of use or presentation of a firearm during commission of a felony and penalties for the same. The bill clarifies requirements for chief officer certification to transfer or make certain firearms and providing definitions and for appeal of same. The bill provides rules of construction for the dangerous weapons article. The bill defines the crime of bigamy. The bill provides a misdemeanor penalty for bigamy. The bill defines the crime of prostitution and related offenses. The bill defines provides for the penalty for prostitution. The bill provides that a medical report certifying no sexually transmitted disease reduces penalty for prostitution. The bill provides a criminal penalty for solicitation of prostitute. The bill provides enhanced criminal penalty for solicitation of an individual for prostitution who is less than 18 years of age, mentally defective or incapacitated. The bill provides fines for soliciting prostitution be paid to the Crime Victims Compensation Fund in designated circumstances. The bill defines the crime of detaining, recruiting, or inducing another to engage in prostitution. The bill provides that a second offense of the same and recruitment of persons under the age of 18 are felony offenses. The bill establishes that parents consenting to using a minor or mentally defective person for prostitution is guilty of a felony. The bill establishes that causing a person to engage in prostitution because of debt or to receive value is subject to misdemeanor penalty. The bill establishes that a person who forces, intimidates or threatens a spouse to engage in prostitution commits a felony offense. The bill provides respective criminal penalties. The bill establishes the criminal offense of abducting, enticing or harboring a child for prostitution. The bill provides a criminal penalty. The bill establishes the crime of promoting and advancing prostitution. The bill defines a house of prostitution in context of promoting prostitution. The bill permits character evidence. The bill provides a criminal penalty, including additional fine, and establishes the offense of sexual solicitation. The bill provides a criminal penalty including additional fine. The bill provides an affirmative defense to sexual solicitation for victims of trafficking. The bill provides affirmative defenses to prostitution relating to human trafficking, abduction and mental defect or incapacitation. The bill establishes aggravating circumstances, restitution, and eligibility for Compensation Award to Victims of Crimes. The bill provides that law enforcement notify DHHR of child victims. The bill provides that any property used for or derived from prostitution is subject to forfeiture. The bill provides that persons convicted be debarred from state or local contracts. The bill defines indecent exposure. The bill clarifies that criminal indecent exposure cannot occur if victim grants permission. The bill classifies criminal penalties for indecent exposure. The bill classifies criminal penalties for inhaling or drinking certain intoxicating compounds. The bill provides the crime of incest, defines \"step-relative\" in context of the crime of incest, establishes that intercourse between two consenting adult step-relatives is not incest, classifying criminal penalty for incest. The bill defines desecration and classifies criminal penalties for unlawful disinterment, desecration, injury to a grave marker or damage to cemetery. The bill prohibits certain demonstrations at a funeral. The bill classifies the criminal penalty for prohibited funeral demonstrations. The bill classifies criminal penalty for obscene, anonymous and threatening phone calls. The bill classifies criminal penalties for cruelty to animals. The bill classifies the criminal penalty for animal fighting, attending an animal fighting venture, or wagering at an animal fighting venture. The bill establishes circumstances, sufficiency and application of a search warrant related to animal cruelty. The bill extends the search warrant authority for birds or animals kept for fighting to natural resources police. The bill clarifies the extent of searches without a warrant for fighting animals or birds. The bill classifies the crime of sexual abuse of an animal and prescribing penalties, including providing for forfeiture of animals, payment of associated costs, providing for restrictions on owning animals upon conviction, and requiring psychiatric evaluation and payment of costs in certain circumstances. The bill classifies the criminal penalty for unlawful admission of children to places injurious to health or morals. The bill classifies criminal penalty for underage false identification. The bill classifies the criminal penalty for criminal invasion of privacy. The bill classifies the criminal penalty for nonconsensual public disclosure of private intimate images. The bill classifies the criminal penalty for criminal loitering within certain distances of minor victims of sexually violent offenses or offenses. The bill classifies the penalties for disclosing or making photographs of accident or emergent situations public. The bill classifies penalties for therapeutic deception. The bill classifies penalties for therapeutic deception. The bill expands definition of computer applied to obscene matter and minors; classifying criminal penalties for distribution and display to minor of obscene matter; classifying criminal penalties for use of obscene matter with intent to seduce minor; classifying criminal penalties for use of minor to produce obscene matter or assist in doing sexually explicit conduct. The bill classifies criminal penalties for sexual assault in the first degree. The bill classifies criminal penalties for sexual assault in the second degree. The bill classifies criminal penalties for sexual assault in the third degree. The bill provides definitions of terms related to the criminal offense of sexual extortion. The bill establishes the elements of the crime of sexual extortion. The bill classifies criminal penalties for sexual abuse in the first degree. The bill classifies criminal penalties for sexual abuse in the second degree. The bill classifies criminal penalties for sexual abuse in the third degree. The bill classifies enhanced criminal penalties for subsequent offenses committed by those previously convicted of sexually violent offenses against children. The bill classifies criminal penalties for imposition of sexual acts on persons incarcerated or under supervision. The bill delineates evidentiary standards for sexual offenses. The bill classifies how courts may terminate certain parental rights when person is convicted for offenses against children. The bill specifies that Ignorance of victim creates incapacity to consent. The bill allows the court to require payment of treatment cost for victim. The bill provides limits on interviews of children eleven years old or less. The bill provides for Forensic Medical Examination Fund for training of sexual assault nurse examiners. The bill provides for payment for costs of forensic medical examination; requiring study of reimbursement of such costs and associated recordkeeping, disclosure standards, and confidentiality; providing a definitions of \"coerce\" and \"visually portray\" in the context of the crime of filming sexually explicit conduct of minors. The bill classifies a criminal penalty for producing a visual portrayal of a minor in sexually explicit conduct. The bill provides for enhanced penalty when parent distributes material displaying a child under their care in sexually explicit conduct. The bill classifies penalties when any person distributes or exhibits material displaying a minor in sexually explicit conduct. The bill classifies penalties for production, display or distribution of visual portrayals of partially clothed minors. The bill defines \"visual portrayal\" in context of prohibited possession, manufacture or distribution of inappropriate sexual portrayals by a minor; clarifying the definition of \"parent\" in context of child abuse to include step or foster parent. The bill classifies criminal penalties for murder of custodial child for failure or refusal to supply necessities. The bill clarifies the definition of \"recognized method of religious healing\" in context of murder of custodial child for failure or refusal to supply necessities. The bill classifies criminal penalties for death of a child by child abuse. The bill classifies criminal penalties for child abuse causing or creating a risk of injury. The bill classifies the criminal penalty for female genital mutilation. The bill classifies the criminal penalty for child neglect resulting in death. The bill clarifies in context of the crime of child neglect resulting in death, and clarifies that care through recognized method of religious healing in lieu of medical treatment may not constitute neglect. The bill defines a recognized method of religious healing. The bill classifies the criminal penalty for sexual abuse by a parent, guardian, custodian or person in a position of trust to a child. The bill classifies the criminal penalty for procuring, authorizing or inducing another to engage in sexual acts with a child under their care or custody. The bill defines sexual abuse by a parent, guardian, custodian or person in a position of trust to a child. The bill defines a parent, guardian, custodian, or person in a position of trust procuring, authorizing, inducing a to a child sixteen or older. The bill provides a definition of terms related to nuisances. The bill defines designated elements for maintaining a nuisance. The bill provides standing to bring an action to abate a nuisance. The bill provides a venue for a nuisance action. The bill defines evidence and proof related to an action to abate nuisance. The bill defines provisions and procedures related to an action to enjoin a nuisance. The bill defines prima facie evidence of a nuisance. The bill defines a prosecution of a nuisance complaint. The bill defines provisions for dismissal of a nuisance action. The bill provides for an award of costs related to a nuisance action. The bill defines when the existence of nuisance established permanent injunction required. The bill defines an order of abatement for a nuisance. The bill defines elements of a nuisance abatement order. The bill defines removal and sale of movable property from a nuisance. The bill defines liability of officers disposing of property from a nuisance proceeding. The bill defines a criminal offense of contempt related to nuisance proceedings. The bill creates a definition of terms related to gaming and gambling. The bill creates a criminal offense for possessing or dealing in unlicensed gaming devices or permitting an unlicensed gambling device on premises under unauthorized ownership, leasehold, occupation or possession. The bill defines a seizure of unlicensed gaming or gambling devices. The bill creates a criminal offense of acting as a guard or interfering with lawful intervention for gambling premises. The bill defines a criminal offense of unauthorized wagering on outcomes of uncertain events or prohibited games. The bill creates a criminal offense of betting on games of chance. The bill creates a criminal offense for a unauthorized commercial gambling at a hotel or tavern. The bill creates a criminal offense for cheating at gaming. The bill creates a criminal offense of unauthorized dealing in gambling device. The bill defines a lottery and raffle. The bill defines a criminal offense for unauthorized operation of an illegal lottery or raffle. The bill creates a criminal offense for unauthorized sale of a voucher or certificate for gambling on outcome of sporting events, games of skill or other sport or contest. The bill declares a premises for unauthorized commercial gambling a nuisance. The bill provides that proceeds of an illegal lottery forfeit to the state. The bill creates the criminal offense of keeping policy or numbers slips. The bill defines seizure of designated gambling devices and equipment. The bill provides for seizure authority for gambling articles or apparatuses. The bill classifies criminal penalties for crime of certain public officials with pecuniary interest in certain public contracts. The bill classifies the criminal offense of unlawful showing of pictures, advertisement or theatrical productions calculated to arouse prejudicial ire or feelings. The bill classifies the criminal offense of lobbying on the floor of the legislature. The bill classifies the crime of employers who fail or refuse to pay contracted employment benefits or contributions. The bill clarifies the elements of the crime of bribery of participants in professional or amateur games and horse racing. The bill classifies the criminal penalty for debt pooling. The bill clarifies the elements of the crime of debt pooling. The bill classifies the criminal penalty for failure to maintain and affix a cover for a water well. The bill classifies the penalty for the crime of conspiracy. The bill classifies the penalty for the crime of unlawful contact with a corrections employee or a member of the parole board. The bill classifies the penalty for prohibited sale of certain caffeine products; generally providing for the sentence of felons. The bill provides a definition for corruption of blood and forfeiture of estate abolished. The bill provides the commission of a felony shall not stay or merge any civil remedy. The bill classifies the criminal penalties for punishment of principals in the second degree and designated accessories. The bill delineates attempt crimes and the classification and penalties for the same. The bill classifies the criminal penalties for solicitation to commit certain crimes; delineating punishments for second or third offense of felony. The bill explains the treatment of cumulative sentences. The bill provides for pretrial diversion agreements, conditions of the same, and for drug court programs. The bill provides for deferred adjudication. The bill provides for expungement of certain criminal convictions with approved treatment or recovery and job program. The bill provides for a limitation on expungement for certain motor vehicle traffic control offenses. The bill classifies the criminal penalties for crimes related to postmortem examinations. The bill classifies the criminal penalties for failing to secure a cremation permit. The bill clarifies evidentiary admissibility of autopsy reports an investigation. The bill classifies the penalties for organized criminal enterprise offenses. The bill classifies the criminal penalties for the offense of human trafficking. The bill classifies the criminal penalties for the offense of forced labor. The bill classifies the criminal penalties for the offense of using adults or minors in debt bondage. The bill classifies the criminal penalties for the offense of coercing or compelling an individual to engage in commercial sexual. The bill classifies the criminal penalties for the offense of patronizing a victim of sexual servitude. The bill establishes that an individual convicted of a human trafficking offense who is sentenced to life without mercy is not eligible for parole. The bill provides immunity for minor victims of sex trafficking. The bill provides for vacation and expungement of criminal conviction for persons sexually trafficked. The bill classifies the criminal penalty for money laundering. The bill classifies the criminal penalty for prohibited use of unmanned aircraft systems. The bill classifies criminal offenses and respective sentencing dispositions. The bill establishes that felonies are classified into six categories and misdemeanors are classified into three categories. The bill provides that petty offenses are not classified. The bill establishes that criminal classification is derived from the defining criminal section or chapter. The bill establishes that petty offenses are specifically designated to include any crime without specified designation or classification. The bill provides that offenses noted outside Chapter 61 which are not designated as a felony, misdemeanor or petty offense, are punished under the prescribed statutory penalty. The bill states that unless provided otherwise felony imprisonment sentence is a term of definite years. The bill establishes respective range of felony terms of imprisonment into six classifications. The bill establishes a respective range of misdemeanor terms of imprisonment within three classifications. The bill provides discretion to the sentencing court to treat a Class 6 felony as a Class 1 misdemeanor with noted exceptions. The bill provides that the trial court impose its sentence within designated range of maximum and minimum terms. The bill requires the court to consider aggravating and mitigating circumstances as well as the pre-sentence report. The bill provides for a potential increased sentence for crimes near a school which may exceed maximum sentencing limits. The bill provides that a felony sentence must be a definite term of years served in the state department of corrections. The bill establishes requirements for transfer of custody. The bill provides a range of imprisonment term for all six felony classes. The bill provides that misdemeanor sentences are for a definite term to be served at somewhere other than the state department of corrections. The bill establishes respective limitations of imprisonment for the three classes of misdemeanors. The bill provides discretion to the court, in certain circumstances, to treat a Class 6 felony as a Class 1 misdemeanor. The bill provides for reimbursement of incarceration costs for misdemeanor offenses. The bill provides a court with discretion to increase sentence by one year for offenses near a school. The bill establishes that a school vicinity sentence enhancement may exceed statutory limit. The bill further provides that if the victim of an offense is a child but is not within the designated range of a school that the court may consider relevant circumstances and increase the sentence two years. The bill establishes fines for felony offenses. The bill establishes fines for misdemeanor offenses. The bill states that for purposes of sentencing, defines an \"enterprise\" as any entity other than a person. The bill provides a graduated penalty of fines imposed upon enterprise for criminal offenses. The bill establishes that a judgment of fine against an enterprise constitutes a lien. The bill establishes relevant factors for the court to consider when sentencing an enterprise for criminal conduct. The bill requires the court to order a person incarcerated for a criminal offense to pay incarceration costs. The bill establishes factors for the court to consider when assessing payment of incarceration costs. The bill provides that an alleged victim of sexual offense may not be required to submit to a polygraph examination or other truth telling device as a condition of investigating an alleged offense nor may prosecutors or law-enforcement officers decline to proceed if the victim refuses such examination. The bill delineates eligibility for probation, and, provides for a period of extended supervision for certain sexual offenders.", "pending_committee_id": 11, "committee": {"committee_id": 11, "chamber": "H", "chamber_id": 1, "name": "Judiciary"}, "referrals": [{"date": "2023-01-13", "committee_id": 11, "chamber": "H", "chamber_id": 1, "name": "Judiciary"}], "history": [{"date": "2023-01-13", "action": "Filed for introduction", "chamber": "H", "chamber_id": 1, "importance": 0}, {"date": "2023-01-13", "action": "To Judiciary", "chamber": "H", "chamber_id": 1, "importance": 0}, {"date": "2023-01-13", "action": "Introduced in House", "chamber": "H", "chamber_id": 1, "importance": 1}, {"date": "2023-01-13", "action": "To House Judiciary", "chamber": "H", "chamber_id": 1, "importance": 1}], "sponsors": [{"people_id": 20548, "person_hash": "4dwhwzon", "party_id": "2", "state_id": 48, "party": "R", "role_id": 1, "role": "Rep", "name": "Brandon Steele", "first_name": "Brandon", "middle_name": "Scott", "last_name": "Steele", "suffix": "", "nickname": "", "district": "HD-029", "ftm_eid": 44272303, "votesmart_id": 177733, "opensecrets_id": "", "knowwho_pid": 653109, "ballotpedia": "Brandon_Steele", "bioguide_id": "", "sponsor_type_id": 1, "sponsor_order": 1, "committee_sponsor": 0, "committee_id": 0, "state_federal": 0}], "sasts": [], "subjects": [{"subject_id": 129901, "subject_name": "Crime"}], "texts": [{"doc_id": 2639935, "date": "0000-00-00", "type": "Introduced", "type_id": 1, "mime": "text/html", "mime_id": 1, "url": "https://legiscan.com/WV/text/HB2527/id/2639935", "state_link": "http://www.wvlegislature.gov/Bill_Status/bills_text.cfm?billdoc=hb2527%20intr.htm&yr=2023&sesstype=RS&i=2527", "text_size": 1409273, "text_hash": "6a6a04ec89293b94ae79ae6519f0caba"}], "votes": [], "amendments": [], "supplements": [], "calendar": []}}